//-------------------------------------------------------------------------------------------------
// File : BasicPS.hlsl
// Desc : Basic Pixel Shader.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------

//-------------------------------------------------------------------------------------------------
// Includes
//-------------------------------------------------------------------------------------------------
#include "Basic.hlsli"


//-------------------------------------------------------------------------------------------------
//          ピクセルシェーダメインエントリーポイントです.
//-------------------------------------------------------------------------------------------------
PSOutput PSFunc(VSOutput input)
{
    PSOutput output = (PSOutput)0;

    float4 diffuseMap = ColorMap.Sample( ColorSmp, input.TexCoord );

    output.Color.rgb = Diffuse * diffuseMap.rgb;
    output.Color.a = Alpha * diffuseMap.a;

    return output;
}
